<script lang="ts" setup>
import { INFO_PAGE_LIST } from "@/modules/Info/data/info.const";

const getTitle = (docId: string): string => {
  return INFO_PAGE_LIST.find((doc) => doc.id === docId)?.title || "";
};
</script>

<template>
  <LayoutBase>
    <template #sidebar>
      <LayoutSidebar />
    </template>
    <template #content>
      <main class="info-confidency-page page">
        <h1 class="page-info__title page-title">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h1>
        <ol>
          <li>
            Настоящая Политика конфиденциальности в отношении персональных данных и порядка сбора данных о действиях Пользователя
            (далее – Политика) действует в отношении всей информации о Пользователе, доступной через Мобильное приложение или
            Сайт, которую могут получить Поставщик и другие Пользователи при использовании Пользователем Яруса.
          </li>

          <li>
            Настоящая политика открыто размещена по адресу в сети Интернет
            <a href="https://yarus.ru/confidency.pdf" :title="getTitle('confidency')">https://yarus.ru/confidency.pdf</a> и
            является неотъемлемой частью Пользовательского соглашения, открыто размещенного по адресу в сети Интернет
            <a href=" https://yarus.ru/agreement.pdf" :title="getTitle('agreement')"> https://yarus.ru/agreement.pdf</a>.
          </li>

          <li>
            Использование Ярус (через Сайт или Мобильное приложение) означает безоговорочное согласие Пользователя с настоящей
            Политикой и указанными в ней условиями обработки его персональных информации; в случае несогласия с этими условиями
            Пользователь должен отказаться от использования Яруса.
          </li>

          <li>
            Правовыми основаниями обработки персональных данных являются, в частности, части 1, 8 пункта 1 статьи 6 Федерального
            закона РФ «О персональных данных».
          </li>

          <li>В рамках настоящей Политики под персональной информацией Пользователя понимаются:</li>

          <li>
            Персональная информация, которую Пользователь предоставляет о себе самостоятельно при регистрации (создании учетной
            записи) или в процессе использования Ярус, включая персональные данные Пользователя. Обязательная для предоставления
            информация помечена специальным образом (например, знаком «*»). Иная информация предоставляется Пользователем на его
            усмотрение.
          </li>

          <li>
            Данные, которые автоматически передаются в Ярус в процессе их использования с помощью установленного на устройстве
            Пользователя программного обеспечения, в том числе IP-адрес, данные файлов cookie, информация о браузере Пользователя,
            Мобильном приложении или иной программе, с помощью которой осуществляется доступ, технические характеристики
            оборудования и его программного обеспечения, используемых Пользователем, дата и время доступа к Ярус, адреса
            запрашиваемых страниц (Контента) и иная подобная информация.
          </li>

          <li>
            Иная информация о Пользователе, обработка которой предусмотрена Пользовательским соглашением и настоящей Политикой.
            Настоящая Политика применяется только к Сайту и Мобильным приложениям Поставщика. Поставщик не контролирует и не несет
            ответственности за Интернет-ресурсы (сайты, приложения и т.д.) третьих лиц, на которые Пользователь может перейти по
            ссылкам, доступным в Ярусе.
          </li>

          <li>
            Поставщик собирает и хранит только ту персональную информацию, которая необходима для предоставления доступа к Ярус,
            исполнения соглашений (пользовательского) и договоров с Пользователем, за исключением случаев, когда законодательством
            предусмотрено обязательное хранение персональной информации в течение определенного законом срока.
            <ol>
              <li>
                Поставщик обрабатывает данные, предоставленные Пользователем при регистрации Учетной записи на Сайте и/или в
                Мобильном приложении:
              </li>
              <li>Номер мобильного телефона;</li>
            </ol>
          </li>

          <li>
            Адрес электронной почты, и связанными с ней данными – фамилия, имя, отчество (при наличии), дата рождения, пол, логин.
          </li>

          <li>
            Поставщик обрабатывает дополнительные данные, предоставленные Пользователем при редактировании Профиля и ходе
            пользования Ярус:

            <ol>
              <li>Фото Пользователя,</li>

              <li>Регион расположения Пользователя,</li>

              <li>Интересы Пользователя,</li>

              <li>Информация, которую Пользователь о себе сообщил сам.</li>
            </ol>
          </li>

          <li>
            На сайте Поставщик использует файлы cookie, которые помогают ему создать максимально удобные для Пользователя условия
            пользования Сайтом. Cookie файлы представляют собой небольшие текстовые файлы, которые сохраняются на жестком диске
            компьютера Пользователя при посещении Сайта.

            <ol>
              <li>
                На Сайте используются несколько типов файлов cookie:
                <ul>
                  <li>
                    Файлы cookie для корректной работы Сайта. Они позволяют Пользователю передвигаться по Сайту и использовать
                    его. Если Пользователь не согласен использовать данный тип файлов, то это может ухудшить производительность
                    Сайта или его компонентов.
                  </li>

                  <li>
                    Файлы cookie для аналитики. При помощи них Поставщик узнает, как Пользователи работают с Сайтом, какие
                    страницы посещают и сколько времени находятся на Сайте. Они также позволяют измерять эффективность рекламных
                    кампаний и оптимизировать содержание Сайта для Пользователей, которые заинтересовались той или иной рекламой.
                    Эти файлы не идентифицирует Пользователя. Информация анонимна.
                  </li>

                  <li>
                    Файлы cookie для постоянных Пользователей. При помощи них Поставщик подбирает содержание Сайта для тех, кто
                    повторно заходит на Сайт. Если Пользователь блокирует их, то это может повлиять на функциональность Сайта и
                    ограничить доступ к информации.
                  </li>

                  <li>
                    Файлы cookie для рекламы. В них записываются сведения о действиях Пользователя в сети Интернет, о посещении
                    Сайта и его страниц, а также данных о ссылках и рекламе, которые Пользователь выбирал для просмотра. Благодаря
                    этому Поставщик предоставляет Пользователю рекламу и другую информацию с более точным соответствием его
                    интересам.
                  </li>
                </ul>
              </li>

              <li>
                Некоторые файлы cookie действуют с момента входа Пользователя на Сайт и до конца работы в браузере. При закрытии
                браузера эти файлы становятся ненужными и автоматически удаляются. Такие файлы cookie называются «сеансовыми».
              </li>

              <li>
                Некоторые файлы cookie сохраняются на устройстве в промежутке между сессиями работы в браузере. Такие файлы cookie
                называются «постоянными». Срок хранения постоянных файлов cookie на устройстве зависит от их функций.
              </li>

              <li>
                Файлы cookie размещаются на устройстве Пользователя владельцем Сайта (в т.ч. поддоменов). Эти файлы cookie
                называются «собственными».
              </li>

              <li>
                Некоторые файлы cookie могут размещаться на устройстве Пользователя другими операторами: Яндекс.Метрика, Google
                Analytics и других. Такие файлы cookie называются файлами «третьих лиц».
              </li>

              <li>
                Поставщик вместе с технологическими партнерами и поставщиками услуг, предоставляет рекламу и персонализированный
                контент, который, по его мнению и по мнению других рекламодателей, будет представлять интерес для Пользователя.
                Сторонние поставщики используют файлы cookie при реализации сервисов Поставщику или другим лицам. В таких случаях
                Поставщик не контролирует использование указанной технологии или полученной при этом информации и не несет
                ответственности за любые действия или политики третьих лиц.
              </li>

              <li>
                Реклама может предоставляться Пользователю с учетом его деятельности (активности) в сети Интернете или при
                использовании мобильных устройств, а также с учетом его действий при поиске, отклике на одно из рекламных
                объявлений Поставщика или электронных писем, посещенных страницах, его географического региона или другой
                информации. Такие рекламные объявления могут появляться на Сайте или на сайтах третьих лиц.
              </li>

              <li>
                Большинство интернет-браузеров автоматически принимают cookie. Пользователь может изменить настройки, чтобы
                блокировать cookie или получать предупреждения, когда файлы данного типа будут отправлены на устройство.
              </li>

              <li>
                Если Пользователь отключит cookies, то Сайт может перестать корректно работать и Поставщик не сможем предоставлять
                индивидуальные предложения и улучшать Сайт.
              </li>

              <li>
                Если Пользователь использует различные устройства для доступа к Сайту, то он должен убедиться, что каждый браузер
                на каждом устройстве настроен в соответствии с его точкой зрения при работе с файлами cookies.
              </li>
            </ol>
          </li>

          <li>
            Персональную информацию Пользователя Поставщик обрабатывает в следующих целях:

            <ol>
              <li>
                Идентификации, аутентификации и авторизации Пользователя в Ярус, предоставления Пользователю доступа к
                персонализированному, расширенному функционалу Яруса.
              </li>

              <li>
                Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся пользования
                Ярусом.
              </li>

              <li>Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</li>

              <li>Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</li>

              <li>Создания учетной записи (Профиля) Пользователя, если Пользователь дал согласие на создание учетной записи.</li>

              <li>Уведомления Пользователя Яруса об обновлениях, изменениях соглашений (Политик, Специальных условий и т.д.).</li>

              <li>
                Предоставления Пользователю эффективной технической поддержки при возникновении проблем, связанных с
                использованием Яруса.
              </li>

              <li>Осуществления рекламной деятельности (e-mail рассылок, push- и sms-сообщений) с согласия Пользователя.</li>

              <li>
                Поставщик не раскрывает третьим лицам и не распространяет персональные данные Пользователей без их согласия кроме
                случаев, предусмотренных федеральным законом.
              </li>
            </ol>
          </li>

          <li>
            Поставщик обрабатывает персональную информацию Пользователей, в том числе, в том объеме и порядке, как предусмотрены
            Специальными условиями, если Пользователь акцептовал их.
          </li>

          <li>
            В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме случаев добровольного
            предоставления Пользователем информации о себе для общего доступа неограниченному кругу лиц.
          </li>

          <li>
            При использовании отдельных сервисов Яруса Пользователь соглашается с тем, что определенная часть его персональной
            информации может стать общедоступной.
          </li>

          <li>
            Поставщик вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:

            <ol>
              <li>Пользователь выразил согласие на такие действия.</li>

              <li>
                Передача необходима для использования Пользователем определенного сервиса либо для исполнения определенного
                соглашения с Пользователем.
              </li>

              <li>
                Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством
                процедуры.
              </li>

              <li>
                В случае продажи Яруса к приобретателю переходят все обязательства по соблюдению условий настоящей Политики
                применительно к полученной им персональной информации.
              </li>
            </ol>
          </li>

          <li>
            Обработка персональных данных Пользователя осуществляется без ограничения срока любым законным способом, в том числе в
            информационных системах персональных данных с использованием средств автоматизации или без использования таких
            средств. Обработка персональных данных Пользователей осуществляется в соответствии с Федеральным законом от 27.07.2006
            №152-ФЗ «О персональных данных».
          </li>

          <li>
            Данные обрабатываются бессрочно либо до момента, когда Пользователь откажется от пользования Ярус и удалит свою
            Учетную запись.
          </li>

          <li>
            При утрате или разглашении персональных данных Поставщик информирует Пользователя об утрате или разглашении
            персональных данных.
          </li>

          <li>
            Поставщик принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от
            неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от
            иных неправомерных действий третьих лиц. Поставщик предоставляет доступ к персональным данным Пользователя только тем
            лицам (контрагентам и работникам Поставщика), которым эта информация необходима для обеспечения функционирования Ярус
            и предоставления Пользователю доступа к Ярус. Поставщик вправе использовать предоставленную Пользователем информацию,
            в том числе персональные данные, а также передавать ее третьим лицам, в целях обеспечения соблюдения требований
            действующего законодательства Российской Федерации, защиты прав и интересов Пользователей, Поставщика, третьих лиц (в
            том числе в целях выявления, проверки/расследования и/или пресечения противоправных действий). Раскрытие
            предоставленной Пользователем информации может быть произведено лишь в соответствии с действующим законодательством
            Российской Федерации – по требованию суда, правоохранительных органов, а равно в иных, предусмотренных
            законодательством Российской Федерации случаях.
          </li>

          <li>
            Поставщик совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных
            последствий, вызванных утратой или разглашением персональных данных Пользователя.
          </li>

          <li>
            Пользователь обязан:

            <ol>
              <li>Предоставить информацию о персональных данных, необходимую для пользования Ярусом.</li>

              <li>Обновлять, дополнять предоставленную информацию о персональных данных в случае изменения данной информации.</li>
            </ol>
          </li>

          <li>
            Поставщик обязан:

            <ol>
              <li>
                Использовать полученную информацию исключительно для целей, указанных в настоящей Политике, Пользовательском
                соглашении, Специальных условиях.
              </li>
              <li>
                Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения
                Пользователя, а также не осуществлять продажу, обмен, опубликование либо разглашение иными возможными способами
                переданных персональных данных Пользователя, за исключением предусмотренных настоящей Политикой.
              </li>

              <li>
                Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку,
                обычно используемому для защиты такого рода информации в существующем деловом обороте.
              </li>

              <li>
                Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или
                запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов
                персональных данных на период проверки в случае выявления недостоверных персональных данных или неправомерных
                действий.
              </li>
            </ol>
          </li>

          <li>
            Поставщик, не исполнивший свои обязательства, несет ответственность за убытки, понесенные Пользователем в связи с
            неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации.
          </li>

          <li>
            В случае утраты или разглашения конфиденциальной информации Поставщик не несет ответственности, если данная
            конфиденциальная информация:

            <ol>
              <li>Стала публичным достоянием до ее утраты или разглашения.</li>

              <li>Была получена от третьей стороны до момента ее получения Поставщиком.</li>

              <li>Была разглашена с согласия Пользователя.</li>
            </ol>
          </li>

          <li>
            До обращения в суд с иском по спорам, возникающим из отношений между Пользователем Яруса и Поставщиком, обязательным
            является предъявление претензии (письменного предложения о добровольном урегулировании спора).

            <ol>
              <li>
                Порядок предъявления и рассмотрения претензий, условие о компетентном суде определены в Пользовательском
                соглашении.
              </li>

              <li>К настоящей Политике применяется действующее законодательство Российской Федерации.</li>
            </ol>
          </li>

          <li>
            Поставщик вправе вносить изменения в настоящую Политику без согласия Пользователя в таком же порядке, как он
            предусмотрен для Пользовательского соглашения. Новая Политика вступает в силу с момента ее доступности в Ярусе (на
            Сайте или в Мобильном приложении).
          </li>

          <li>
            Все предложения, вопросы, претензии и требования по настоящей Политике следует сообщать по адресу электронной почты
            <a href="mailto:support@yarus.ru">support@yarus.ru</a> .
          </li>

          <li>
            Пользователь, как субъект персональных данных, вправе направить запрос Поставщику на получение информации, касающейся
            обработки его персональных данных в соответствии с требованиями статьи 14 Федерального закона РФ «О персональных
            данных».
          </li>

          <li>
            Поставщик принимает меры, необходимые и достаточные для обеспечения выполнения обязанностей, предусмотренных
            Федеральным законом «О персональных данных» и принятыми в соответствии с ним нормативными правовыми актами. Поставщик
            самостоятельно определяет состав и перечень мер, необходимых и достаточных для обеспечения выполнения таких
            обязанностей.
          </li>
        </ol>
      </main>
    </template>
  </LayoutBase>
</template>

<style lang="scss">
.info-confidency-page {
  @include body-16;

  ul {
    padding-left: 3.2rem;
    list-style: disc;
  }

  ol {
    padding-left: 3.2rem;
    list-style: auto;
  }

  li {
    margin-top: 1.6rem;
  }

  a {
    color: $blue-100;
    text-decoration: underline;
  }
}
</style>
