<script setup lang="ts">
import FaqItemModel from "@/modules/Main/models/FaqItemModel";
import Seo from "@/modules/Seo/components/Seo.vue";

import { ref } from "vue";

const activeId = ref<number | null>(null);

const faqs = ref<FaqItemModel[]>([
  {
    id: 1,
    title: "Как создать аккаунт в ЯRUS?",
    description:
      "Создать аккаунт в ЯRUS можно с помощью регистрации по номеру телефона. При регистрации вам придет SMS с кодом, состоящим из четырех цифр. Используйте код в качестве пароля от вашего аккаунта. Если вы хотите изменить пароль, то сделать это можно в настройках своего профиля.",
  },
  {
    id: 2,
    title: "Почему я Гусь Загадочный?",
    description:
      "При регистрации система подбирает для вас случайное имя и аватарку. Для изменения данных необходимо зайти на свою страницу и нажать на кнопку “Редактировать профиль”.",
  },
  {
    id: 3,
    title: "Как получить верификацию (синюю “галочку” возле ника)?",
    description:
      "Верификация (синяя “галочка”) – подтверждение подлинности аккаунта. Фактически аккаунты с “галочкой” помогают бороться с фейками и вызывают большее доверие у других пользователей. \n\n Условия верификации: \n\n - от 100к живых подписчиков в Instagram / YouTube / TikTok / Яндекс Дзен / ВКонтакте; \n - и / или верифицированный аккаунт в Instagram / YouTube / TikTok / Яндекс Дзен / ВКонтакте; \n - и / или публичная личность, публикации в федеральных СМИ; \n - или от 15 000 подписчиков у нас. \n\n Каждая заявка рассматривается в индивидуальном порядке. \n Обращаем ваше внимание на то, что пустые и неактивные аккаунты на ЯRUS не верифицируются (последняя публикация не менее недели назад).\n\n Перед отправлением заявки на верификацию, уделите внимание оформлению и наполнению вашего профиля и лент:\n - дайте лаконичное название; \n - добавьте фото профиля и обложки лент; \n - опубликуйте не менее 10 единиц уникального авторского контента (посты/сюжеты/видео).\n Это повысит ваши шансы на получение верификации! :)\n\n Если вы считаете, что соответствуете каким-либо из условий, пишите нам в Telegram @yarusbloggers.\n В сообщении укажите:\n - по какому основанию вы претендуете на получение верификации;\n- укажите ссылки на ваши соцсети, на ЯRUS, на публикации о вас в СМИ.\n\nЗаявка на верификацию рассматривается в течение 20 дней. Администрация ЯRUS имеет право отказать в верификации без объяснения причин.",
  },
  {
    id: 4,
    title: "Как создать бизнес-аккаунт?",
    description:
      "Пока в нашем приложении нет разницы между личным и бизнес-аккаунтом. Вы можете создавать на одном аккаунте множество тематических лент и одну из них посвятить вашему любимому делу 😉",
  },
  {
    id: 5,
    title: "Есть ли в ЯRUS платное продвижение?",
    description: `В нашем приложении нет рекламы. Вы можете продвигаться бесплатно - выкладывайте качественный контент, ваши посты автоматически попадут в главную ленту после успешного прохождения модерации, там их могут увидеть другие пользователи. Если на пост отреагировало большое количество пользователей, то он автоматически попадает в начало ленты. Не забывайте ставить тематические хештеги, по ним ваши посты также смогут найти.`,
  },
  {
    id: 6,
    title: "Мой контент набирает мало просмотров. Что делать?",
    description:
      "В таком случае мы советуем вам ставить хештеги по тематике вашей публикации, мотивировать вашу аудиторию на лайки и комментарии, искать единомышленников для взаимных активностей, а также экспериментировать с форматами и тематиками контента.",
  },
  {
    id: 7,
    title: "Как настроить ЯRUSы по интересам?",
    description:
      "Рекомендуем создать персональные ЯRUSы и получать актуальную информацию по вашим интересам в одном месте: \n - Зайдите на главный экран сайта; \n- Кликните на «Мои ЯRUSы»; \n - Пропишите ваши интересы и выберите источники, из которых хотите получать информацию. \n\n Можете создавать неограниченное количество ЯRUSов, чтобы фильтровать и сортировать поток информации по разным темам.",
  },
  {
    id: 8,
    title: "Как попасть в топ главной ленты?",
    description:
      "Мы работаем над разными алгоритмами вывода ваших публикаций в топ. Один из вариантов - публикации, набравшие наибольшее количество лайков и комментариев. Но не забывайте, что лента постоянно обновляется. Советуем вам поработать над качеством контента, использовать хештеги и экспериментировать с темами и форматами. Наш искусственный интеллект очень умён, и он поймет, какой контент достоин быть в топе ;)",
  },
  {
    id: 9,
    title: "Что такое лента?",
    description:
      "Вы можете создавать ленты, чтобы сделать вашу страницу более удобной и понятной другим пользователям. Например, вы пишите о себе, рукоделии, бизнесе и эзотерике. На каждую тему можно вести отдельную ленту, чтобы не перемешивать все в одном блоге, и ваши подписчики могли выбрать наиболее интересные для них темы. И если человеку интересно читать только о бизнесе, то он подпишется только на одну вашу ленту, а подписываясь на ваш профиль, он будет подписан на все ваши ленты автоматически. Таким образом, лента может стать целым сообществом ваших единомышленников 😉",
  },
  {
    id: 10,
    title: "Можно ли скачать ЯRUS не в РФ?",
    description:
      "ЯRUS можно установить и в другой стране. Для этого скачивайте APK-версию приложения с сайта http://yarus.ru/ и регистрируйтесь по номеру телефона, который начинается на +7.",
  },
  {
    id: 11,
    title: "Гарантируете ли вы сохранность персональных данных?",
    description:
      "Приложение осуществляет обработку персональных данных, предоставляемых пользователями при регистрации в соответствии требованиям 152-ФЗ “О персональных данных”, а также 149-ФЗ “Об информации, информационных технологиях и о защите информации”. Подробная информация на сайте yarus.ru .",
  },
]);

const itemClickHandler = (id): void => {
  activeId.value = activeId.value === id ? null : id;
};
</script>

<template>
  <Seo />
  <LayoutBase>
    <template #sidebar>
      <LayoutSidebar />
    </template>
    <template #content>
      <main class="faq-page page">
        <h1 class="faq-page__title page-title">FAQ</h1>
        <div class="faq-page__accordion">
          <div v-for="item of faqs" :key="item.title" class="faq-page__accordion__item">
            <div class="faq-page__accordion__item__title" @click="itemClickHandler(item.id)">
              <span>{{ item.title }}</span>
              <BaseIcon class="faq-page__accordion__item__icon" :name="item.id === activeId ? 'arrow-up' : 'arrow-down'" />
            </div>
            <transition name="faq-fade">
              <div v-if="item.id === activeId" class="faq-page__accordion__item__description">
                {{ item.description }}
              </div>
            </transition>
          </div>
        </div>
      </main>
    </template>
  </LayoutBase>
</template>

<style lang="scss">
.faq-page__title {
  margin-bottom: 4rem;
}

.faq-page__accordion {
  &__item {
    margin-bottom: 1.6rem;
    background-color: $gray-100;
    border-radius: $border-radius-md;

    &__title {
      @include headline-18;

      display: flex;
      justify-content: space-between;
      padding: 1.6rem 2.4rem;
      cursor: pointer;
    }

    &__icon {
      flex-shrink: 0;
    }

    &__description {
      @include body-18;

      padding: 1.2rem 2.4rem 1.6rem;
      white-space: pre-line;
    }
  }
}

.faq-fade-enter-active {
  transition: opacity 0.5s ease-in-out;
}

.faq-fade-enter-from,
.faq-fade-leave-to {
  opacity: 0;
}
</style>
